Revit 2024 API
BalusterPlacement.BalusterPerTreadFamilyId Property
 The id of baluster per tread family.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId BalusterPerTreadFamilyId { get; set; }
Visual Basic
Public Property BalusterPerTreadFamilyId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BalusterPerTreadFamilyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The property defines a baluster family type which is used for creation of balusters on treads. The number of such balusters is set by "BalusterPerTreadNumber" property. It works only for stairs which have treads and have "UseBalusterPerTreadOnStairs" set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The balusterPerTreadFamilyId doesn't refer to a valid baluster family.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace